//Для каждого попапа создавайте свой экземпляр класса PopupWithForm

class PopupWithForm {
  constructor (Popup, колбэк_сабмита_формы) {
    super.Popup
  };
  open() {  //здесь вставлять в попап картинку с src изображения и подписью к картинке

  };
  _getInputValues() { //собирает данные всех полей формы

  };
  setEventListeners() {
    //добавляю обработчик клика иконке закрытия
    //добавляю обработчик сабмита формы
  };
  close() {
    //при закрытии попапа форма должна сбрасываться
  };
}
